SEQUENTIAL IF'S


IF COLOR = 'RED'
    MOVE 'R' TO PRT-COLOR.
IF COLOR = 'BLUE'
    MOVE 'B' TO PRT-COLOR.    <----- MAKE SURE YOU HAVE PERIOD '.'
IF COLOR = 'GREEN'
    MOVE 'G' TO PRT-COLOR.


NESTED IF'S 

IF COLOR = 'RED'
    MOVE 'R' TO PRT-COLOR
ELSE
    IF COLOR = 'BLUE'
        MOVE 'B' TO PRT-COLOR
    ELSE
        MOVE 'G' TO PRT-COLOR.     <------ PERIOD ENDS THE 'IF ELSE' STATEMENT. 


COMPOUND IF

IF GENDER = 'M' AND AGE > 70
    MOVE 'OLD MAN' TO PRT-MSG.

IF GENDER NOT = 'F' OR NOT = 'M'  <---- CANNOT PUT 'OR'S AND 'NOT'S TOGETHER. WILL BE TRUE ALWAYS. TWO POSSIBILITES.
    MOVE 'ERROR' TO ERROR-MSG.

________BAD_________
IF GENDER = 'F' OR 'M'
ELSE
    MOVE 'ERROR' TO ERROR-MSG.

_______FIXED________
IF GENDER = 'F' OR 'M'
    NEXT SENTENCE               <------ ADD NEXT SENTENCE TO SKIP.
ELSE
    MOVE 'ERROR' TO ERROR-MSG.




CASE STRUCTURE

EVALUATE *variable*             
    WHEN 'J'                <----- IF STATEMENT IS TRUE IT BREAKS OUT OF THE STRUCTURE.
        STATEMENTS......
    WHEN OTHER
        STATEMENTS...... <---------------IF PERIOD IS HERE YOU DON'T NEED 'END-EVALUATE.'
END-EVALUATE.   <------- OPTIONAL IF THERE IS NO PERIOD ON THE LAST 'WHEN' STATEMENT. 



EX.
EVALUATE AVERAGE        <---- REFERS TO AVERAGE. THAT'S WHY YOU CAN USE THE NUMBERS.
    WHEN 93 THRU 100
        MOVE 'A' TO GRADE
    WHEN 85 THRU 92
        MOVE 'B' TO GRADE
    WHEN 77 THRU 84
        MOVE 'C' TO GRADE
    WHEN 70 THRU 76
        MOVE 'D' TO GRADE
    WHEN OTHER
        MOVE 'F' TO GRADE.
END-EVALUATE

EVALUATE TRUE   <---- IF 'WHEN' IS TRUE DO WHAT'S INSIDE. OR IF 'EVALUATE FALSE' IF 'WHEN' IS FALSE DO WHAT'S INSIDE.
    WHEN AVERAGE >= 93 AND <= 100  <---- HERES HOW IT WOULD GO WITHOUT THE VARIABLE WITH THE EVALUATE STATEMENT.
        MOVE 'A' TO GRADE
    WHEN AVERAGE >= 85 AND <=92
        MOVE 'B' TO GRADE
    WHEN AVERAGE >= 77 AND <= 84
        MOVE 'C' TO GRADE
    WHEN AVERAGE >= 70 AND <= 76
        MOVE 'D' TO GRADE
    WHEN OTHER 
        MOVE 'F' TO GRADE.

EVALUATE TRUE               
    WHEN INS-TYPE = 'L'
        ERFORM 2100-LIFE
    WHEN INS-TYPE = 'M' AND POLICY-DATE <= 1995
        PERFORM 2200-MEIDCAL-GRANDFATHER
    WHEN INS-TYPE = 'D' AND AGE < 18
        PERFORM 2300-UNDERAGE0DENTAL.


IF SOMETHING = TRUE
    DO STUFF
    IF OTHER = TRUE
        PERFORM DO
    END-IF
    DO MORE STUFF.
END-IF.     <---- IF YOU USE ONE END IF. YOU NEED THEM ON THE ENTIRE STRUCTURE FOR EVERY IF.